Ran Plan for dir: `non-prod/eu-central-1/dev/mysql` workspace: `default`

<details><summary>Show Output</summary>

```diff
[terragrunt] 2022/05/22 14:23:51 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql] 2022/05/22 14:23:51 Running command: terraform --version
[terragrunt] 2022/05/22 14:23:51 Downloading Terraform configurations from git::https://github.com/javidaslan/terraform-modules.git into /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo
[terragrunt] 2022/05/22 14:23:51 Copying files from /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql into /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo/mysql
[terragrunt] 2022/05/22 14:23:51 Setting working directory to /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo/mysql
[terragrunt] [/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql] 2022/05/22 14:23:51 Running command: terraform init

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v4.15.1...
- Installed hashicorp/aws v4.15.1 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2022/05/22 14:23:58 Running command: terraform plan -out=/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/default.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_db_instance.mysql[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_instance" "mysql" {
      [32m+[0m [0m[1m[0maddress[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mallocated_storage[0m[0m                     = 20
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0mauto_minor_version_upgrade[0m[0m            = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mbackup_retention_period[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mbackup_window[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mca_cert_identifier[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcharacter_set_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m                 = false
      [32m+[0m [0m[1m[0mdb_name[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdelete_automated_backups[0m[0m              = true
      [32m+[0m [0m[1m[0mendpoint[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                                = "mysql"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                        = "5.6.41"
      [32m+[0m [0m[1m[0mengine_version_actual[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0midentifier[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0midentifier_prefix[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_class[0m[0m                        = "db.t2.micro"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlatest_restorable_time[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mlicense_model[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mmaintenance_window[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_interval[0m[0m                   = 0
      [32m+[0m [0m[1m[0mmonitoring_role_arn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmulti_az[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                  = "aaaaaaatlantis_mysql_dev"
      [32m+[0m [0m[1m[0mnchar_character_set_name[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0moption_group_name[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mparameter_group_name[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpassword[0m[0m                              = (sensitive value)
      [32m+[0m [0m[1m[0mperformance_insights_enabled[0m[0m          = false
      [32m+[0m [0m[1m[0mperformance_insights_kms_key_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_retention_period[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mpublicly_accessible[0m[0m                   = false
      [32m+[0m [0m[1m[0mreplica_mode[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mreplicas[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mresource_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mskip_final_snapshot[0m[0m                   = true
      [32m+[0m [0m[1m[0msnapshot_identifier[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mstorage_type[0m[0m                          = "standard"
      [32m+[0m [0m[1m[0mtags_all[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mtimezone[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0musername[0m[0m                              = "admin"
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m                = (known after apply)
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
  [32m+[0m [0m[1m[0mdb_name[0m[0m  = "aaaaaaatlantis_mysql_dev"
  [32m+[0m [0m[1m[0mendpoint[0m[0m = (known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with aws_db_instance.mysql,
[33m│[0m [0m  on main.tf line 26, in resource "aws_db_instance" "mysql":
[33m│[0m [0m  26:   name     = [4mvar.name[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse db_name instead
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/default.tfplan"

[terragrunt] 2022/05/22 14:24:06 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql] 2022/05/22 14:24:06 Running command: terraform --version
[terragrunt] 2022/05/22 14:24:06 Terraform files in /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo/mysql are up to date. Will not download again.
[terragrunt] 2022/05/22 14:24:06 Copying files from /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql into /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo/mysql
[terragrunt] 2022/05/22 14:24:06 Setting working directory to /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/.terragrunt-cache/Hx7n08vOEz23U4UbTHZIlF71LcI/sJjNawhuFHmyNwjXxSRq0sW7tbo/mysql
[terragrunt] [/home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql] 2022/05/22 14:24:06 Running command: terraform init

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.15.1

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2022/05/22 14:24:08 Running command: terraform show -json /home/atlantis/.atlantis/repos/javidaslan/terragrunt-infra/1/default/non-prod/eu-central-1/dev/mysql/default.tfplan

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/eu-central-1/dev/mysql`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a485c58c42a6:4141/lock?id=javidaslan%252Fterragrunt-infra%252Fnon-prod%252Feu-central-1%252Fdev%252Fmysql%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/eu-central-1/dev/mysql`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
